Ran Plan for 2 projects:

1. dir: `environments/dev` workspace: `default`
1. dir: `environments/prod` workspace: `default`
---

### 1. dir: `environments/dev` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.s3bucket.aws_s3_bucket.main will be created
+ resource "aws_s3_bucket" "main" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "classpass-atlantis-poc-development"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d environments/dev
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://latrisha-labile-julianna.ngrok-free.dev/lock?id=classpass%252Fatlantis-example%252Fenvironments%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d environments/dev
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `environments/prod` workspace: `default`
**Plan Error**
```
running 'sh -c' '/opt/homebrew/bin/terraform init -input=false -upgrade' in '/Users/bay.gaillard/.atlantis/repos/classpass/atlantis-example/2/default/environments/prod': exit status 1
Initializing the backend...
Upgrading modules...
- s3bucket in ../../modules/s3bucket
╷
│ Error: Invalid Value
│ 
│   on main.tf line 10, in terraform:
│   10:     key          = "POC/atlantis//terraform.tfstate"
│ 
│ Value must not contain "//"
╵

```

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```